app/views/statuses/_form.html.erb

SELECT "users".* FROM "users"
---
  </div>
 <%= f.input :user_id, collection: User.all, label_method: :full_name %>